//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
public class Main {
    public static void main(String[] args) {
        //TIP Press <shortcut actionId="ShowIntentionActions"/> with your caret at the highlighted text
        // to see how IntelliJ IDEA suggests fixing it.

        // Задача № 1
        System.out.println(" Задача № 1 ");

        int clientOS = 1;
        if (clientOS == 0) {
            System.out.println("Установите версию приложения для iOS по ссылке");
        } else if (clientOS == 1) {
            System.out.println("Установите версию приложения для Android по ссылке");
        }
        // Задача № 2
        System.out.println(" Задача № 2 ");

        int clientDeviceYear = 2015;
        if (clientOS == 0 && clientDeviceYear < 2015) {
            System.out.println("Установите облегченную версию приложения для iOS по ссылке");
        } else if (clientOS == 1 && clientDeviceYear < 2015) {
            System.out.println("Установите облегченную версию приложения для Android по ссылке");
        } else if (clientOS == 0) {
            System.out.println("Установите версию приложения для iOS по ссылке");
        } else if (clientOS == 1) {
            System.out.println("Установите версию приложения для Android по ссылке");
        }
        // Задача № 3
        System.out.println(" Задача № 3 ");

        int year = 2021;
        if (year <= 1584) {
            System.out.println("Год должен быть больше 1584.");
        } else {
            boolean isLeapYear = (year % 4 == 0 && year % 100 != 0) || (year % 400 == 0);
            System.out.println(year + " год " + (isLeapYear ? "является високосным" : "не является високосным"));
        }
        // Задача № 4
        System.out.println(" Задача № 4 ");

        int deliveryDistance = 95;
        int days = 1;

        if (deliveryDistance > 100) {
            System.out.println("Потребуется дней: доставка недоступна");
        } else if (deliveryDistance > 60) {
            days = days + 2;
        } else if (deliveryDistance > 20) {
            days = days + 1;
        }
        System.out.println("Потребуется дней: " + days);

        // Задача № 5
        System.out.println(" Задача № 5 ");

        int monthNumber = 12;
        switch (monthNumber) {
            case 12:
            case 1:
            case 2:
                System.out.println(monthNumber + "-й месяц декабрь/январь/февраль принадлежит к сезону зима");
                break;
            case 3:
            case 4:
            case 5:
                System.out.println(monthNumber + "-й месяц март/апрель/май принадлежит к сезону весна");
                break;
            case 6:
            case 7:
            case 8:
                System.out.println(monthNumber + "-й месяц июнь/июль/август принадлежит к сезону лето");
                break;
            case 9:
            case 10:
            case 11:
                System.out.println(monthNumber + "-й месяц сентябрь/октябрь/ноябрь принадлежит к сезону осень");
                break;
            default:
                System.out.println("Неверный номер месяца, введите значение от 1 до 12 ");
        }

    }
}